JRB-90/jpower/src/nrf52/lib/imu/lsm6dso_reg.h
typedef enum
{
  LSM6DSO_TEMP_NOT_BATCHED        = 0,
  LSM6DSO_TEMP_BATCHED_AT_1Hz6    = 1,
  LSM6DSO_TEMP_BATCHED_AT_12Hz5   = 2,
  LSM6DSO_TEMP_BATCHED_AT_52Hz    = 3,
} lsm6dso_odr_t_batch_t;
int32_t lsm6dso_fifo_temp_batch_set(const stmdev_ctx_t *ctx,
                                    lsm6dso_odr_t_batch_t val);
int32_t lsm6dso_fifo_temp_batch_get(const stmdev_ctx_t *ctx,
                                    lsm6dso_odr_t_batch_t *val);

typedef enum
{
  LSM6DSO_NO_DECIMATION = 0,
  LSM6DSO_DEC_1         = 1,
  LSM6DSO_DEC_8         = 2,
  LSM6DSO_DEC_32        = 3,
} lsm6dso_odr_ts_batch_t;
int32_t lsm6dso_fifo_timestamp_decimation_set(const stmdev_ctx_t *ctx,
                                              lsm6dso_odr_ts_batch_t val);
int32_t lsm6dso_fifo_timestamp_decimation_get(const stmdev_ctx_t *ctx,
                                              lsm6dso_odr_ts_batch_t *val);

typedef enum
{
  LSM6DSO_XL_BATCH_EVENT   = 0,
  LSM6DSO_GYRO_BATCH_EVENT = 1,
} lsm6dso_trig_counter_bdr_t;

typedef enum
{
  LSM6DSO_GYRO_NC_TAG    = 1,
  LSM6DSO_XL_NC_TAG,
  LSM6DSO_TEMPERATURE_TAG,
  LSM6DSO_TIMESTAMP_TAG,
  LSM6DSO_CFG_CHANGE_TAG,
  LSM6DSO_XL_NC_T_2_TAG,
  LSM6DSO_XL_NC_T_1_TAG,
  LSM6DSO_XL_2XC_TAG,
  LSM6DSO_XL_3XC_TAG,
  LSM6DSO_GYRO_NC_T_2_TAG,
  LSM6DSO_GYRO_NC_T_1_TAG,
  LSM6DSO_GYRO_2XC_TAG,
  LSM6DSO_GYRO_3XC_TAG,
  LSM6DSO_SENSORHUB_SLAVE0_TAG,
  LSM6DSO_SENSORHUB_SLAVE1_TAG,
  LSM6DSO_SENSORHUB_SLAVE2_TAG,
  LSM6DSO_SENSORHUB_SLAVE3_TAG,
  LSM6DSO_STEP_COUNTER_TAG,
  LSM6DSO_GAME_ROTATION_TAG,
  LSM6DSO_GEOMAG_ROTATION_TAG,
  LSM6DSO_ROTATION_TAG,
  LSM6DSO_SENSORHUB_NACK_TAG  = 0x19,
} lsm6dso_fifo_tag_t;
int32_t lsm6dso_fifo_cnt_event_batch_set(const stmdev_ctx_t *ctx,
                                         lsm6dso_trig_counter_bdr_t val);
int32_t lsm6dso_fifo_cnt_event_batch_get(const stmdev_ctx_t *ctx,
                                         lsm6dso_trig_counter_bdr_t *val);

int32_t lsm6dso_rst_batch_counter_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_rst_batch_counter_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6dso_batch_counter_threshold_set(const stmdev_ctx_t *ctx,
                                            uint16_t val);
int32_t lsm6dso_batch_counter_threshold_get(const stmdev_ctx_t *ctx,
                                            uint16_t *val);

int32_t lsm6dso_fifo_data_level_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dso_fifo_status_get(const stmdev_ctx_t *ctx,
                                lsm6dso_fifo_status2_t *val);

int32_t lsm6dso_fifo_full_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_fifo_ovr_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_fifo_wtm_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_fifo_sensor_tag_get(const stmdev_ctx_t *ctx,
                                    lsm6dso_fifo_tag_t *val);

int32_t lsm6dso_fifo_pedo_batch_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_fifo_pedo_batch_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_sh_batch_slave_set(const stmdev_ctx_t *ctx, uint8_t idx, uint8_t val);
int32_t lsm6dso_sh_batch_slave_get(const stmdev_ctx_t *ctx, uint8_t idx, uint8_t *val);

typedef enum
{
  LSM6DSO_DEN_DISABLE    = 0,
  LSM6DSO_LEVEL_FIFO     = 6,
  LSM6DSO_LEVEL_LETCHED  = 3,
  LSM6DSO_LEVEL_TRIGGER  = 2,
  LSM6DSO_EDGE_TRIGGER   = 4,
} lsm6dso_den_mode_t;
int32_t lsm6dso_den_mode_set(const stmdev_ctx_t *ctx,
                             lsm6dso_den_mode_t val);
int32_t lsm6dso_den_mode_get(const stmdev_ctx_t *ctx,
                             lsm6dso_den_mode_t *val);

typedef enum
{
  LSM6DSO_DEN_ACT_LOW  = 0,
  LSM6DSO_DEN_ACT_HIGH = 1,
} lsm6dso_den_lh_t;
int32_t lsm6dso_den_polarity_set(const stmdev_ctx_t *ctx,
                                 lsm6dso_den_lh_t val);
int32_t lsm6dso_den_polarity_get(const stmdev_ctx_t *ctx,
                                 lsm6dso_den_lh_t *val);

typedef enum
{
  LSM6DSO_STAMP_IN_GY_DATA     = 0,
  LSM6DSO_STAMP_IN_XL_DATA     = 1,
  LSM6DSO_STAMP_IN_GY_XL_DATA  = 2,
} lsm6dso_den_xl_g_t;
int32_t lsm6dso_den_enable_set(const stmdev_ctx_t *ctx,
                               lsm6dso_den_xl_g_t val);
int32_t lsm6dso_den_enable_get(const stmdev_ctx_t *ctx,
                               lsm6dso_den_xl_g_t *val);

int32_t lsm6dso_den_mark_axis_x_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_den_mark_axis_x_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_den_mark_axis_y_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_den_mark_axis_y_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_den_mark_axis_z_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_den_mark_axis_z_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO_PEDO_BASE_MODE            = 0x00,
  LSM6DSO_FALSE_STEP_REJ            = 0x10,
  LSM6DSO_FALSE_STEP_REJ_ADV_MODE   = 0x30,
} lsm6dso_pedo_md_t;
int32_t lsm6dso_pedo_sens_set(const stmdev_ctx_t *ctx,
                              lsm6dso_pedo_md_t val);
int32_t lsm6dso_pedo_sens_get(const stmdev_ctx_t *ctx,
                              lsm6dso_pedo_md_t *val);

int32_t lsm6dso_pedo_step_detect_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_pedo_debounce_steps_set(const stmdev_ctx_t *ctx,
                                        uint8_t *buff);
int32_t lsm6dso_pedo_debounce_steps_get(const stmdev_ctx_t *ctx,
                                        uint8_t *buff);

int32_t lsm6dso_pedo_steps_period_set(const stmdev_ctx_t *ctx,
                                      uint16_t val);
int32_t lsm6dso_pedo_steps_period_get(const stmdev_ctx_t *ctx,
                                      uint16_t *val);

typedef enum
{
  LSM6DSO_EVERY_STEP     = 0,
  LSM6DSO_COUNT_OVERFLOW = 1,
} lsm6dso_carry_count_en_t;
int32_t lsm6dso_pedo_int_mode_set(const stmdev_ctx_t *ctx,
                                  lsm6dso_carry_count_en_t val);
int32_t lsm6dso_pedo_int_mode_get(const stmdev_ctx_t *ctx,
                                  lsm6dso_carry_count_en_t *val);

